//  Напишите программу, которая будет принимать на
// вход два числа и выводить, является ли первое число
// кратным второму. Если число 1 не кратно числу 2, то
// программа выводит остаток от деления.
// 34, 5 -> не кратно, остаток 4
// 16, 4 -> кратно

Console.WriteLine("Введите два числа: ");
int number1 =Convert.ToInt32(Console.ReadLine());
int number2 =Convert.ToInt32(Console.ReadLine());

bool result = number1 % number2 == 0;  // bool это правда или нет

if (result) Console.WriteLine("Кратно"); // если правда
else Console.WriteLine($"не кратно, остаток {(number1 % number2)}"); // если не правда
